results/2025-08-26/raw/Chi_JSON_Binding_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17784/json
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.11ms    5.73ms 129.84ms   90.39%
    Req/Sec     3.15k   648.73    10.35k    70.26%
  2004961 requests in 10.02s, 225.63MB read
Requests/sec: 200061.61
Transfer/sec:     22.51MB