results/2025-08-26/raw/Chi_Single_Middleware_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17784/mw/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.67ms    4.31ms  57.06ms   88.49%
    Req/Sec     3.43k   820.95    15.57k    80.05%
  2192926 requests in 10.11s, 303.24MB read
  Socket errors: connect 0, read 83, write 0, timeout 0
Requests/sec: 216871.02
Transfer/sec:     29.99MB