results/2025-08-26/raw/Fiber v3_Deep_Route_Groups_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17785/g1/g2/g3/g4/g5/g6/g7/g8/g9/g10/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.66ms   17.97ms 406.07ms   95.35%
    Req/Sec     4.63k     2.36k   59.73k    86.01%
  2953488 requests in 10.10s, 338.00MB read
  Socket errors: connect 0, read 33, write 0, timeout 0
Requests/sec: 292411.82
Transfer/sec:     33.46MB