results/2025-08-26/raw/Fiber_Middleware_Chain_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17782/mw10/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.00ms   37.23ms 411.96ms   90.25%
    Req/Sec     4.63k     5.22k   96.53k    92.98%
  2892862 requests in 10.10s, 400.03MB read
  Socket errors: connect 0, read 71, write 0, timeout 0
Requests/sec: 286426.94
Transfer/sec:     39.61MB