results/2025-08-26/raw/Fiber_Route_Groups_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17782/api/v1/group/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.73ms   27.00ms 504.82ms   91.61%
    Req/Sec     4.45k     4.46k  134.73k    94.19%
  2836348 requests in 10.10s, 324.59MB read
  Socket errors: connect 0, read 53, write 0, timeout 0
Requests/sec: 280867.11
Transfer/sec:     32.14MB