results/2025-08-26/raw/Fiber_Wildcard_Routing_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17782/wildcard/some/long/path/here
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.05ms   44.18ms 483.22ms   91.78%
    Req/Sec     4.52k     5.35k   91.07k    94.37%
  2820570 requests in 10.10s, 365.83MB read
  Socket errors: connect 0, read 46, write 0, timeout 0
Requests/sec: 279242.16
Transfer/sec:     36.22MB