results/2025-08-26/raw/Gin_Simple_Ping_Pong_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17781/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.34ms    6.31ms 114.92ms   89.62%
    Req/Sec     3.68k     1.55k   52.88k    94.66%
  2345741 requests in 10.11s, 268.45MB read
  Socket errors: connect 0, read 82, write 0, timeout 0
Requests/sec: 232124.56
Transfer/sec:     26.56MB