results/2025-08-26/raw/Gin_URL_Path_Parameter_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17781/param/abc123
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.38ms    6.22ms  98.57ms   89.25%
    Req/Sec     3.56k     0.88k   12.44k    73.49%
  2281679 requests in 10.11s, 265.47MB read
  Socket errors: connect 0, read 80, write 0, timeout 0
Requests/sec: 225710.79
Transfer/sec:     26.26MB