results/2025-08-26/raw/Gin_Wildcard_Routing_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17781/wildcard/some/long/path/here
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.44ms    6.12ms  93.51ms   88.62%
    Req/Sec     3.58k     1.11k   23.37k    80.03%
  2289106 requests in 10.11s, 299.08MB read
Requests/sec: 226505.50
Transfer/sec:     29.59MB