results/2025-08-26/raw/GoFlash_Middleware_Chain_batch1_retry0.txt
Running 10s test @ http://127.0.0.1:17780/mw10/ping
  64 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.40ms    6.10ms 109.54ms   89.29%
    Req/Sec     3.47k     0.97k   15.77k    81.66%
  2221661 requests in 10.11s, 254.25MB read
  Socket errors: connect 0, read 87, write 0, timeout 0
Requests/sec: 219793.36
Transfer/sec:     25.15MB